app/controllers/notifications_controller.rb

SELECT  "notifications".* FROM "notifications"  ORDER BY "notifications"."id" DESC LIMIT 1
INSERT INTO "notifications" ("guid", "created_at", "updated_at") VALUES (?, ?, ?)  [["guid", "https://martynchamberlin.com/console-log-objects/"], ["created_at", "2016-04-01 02:40:54.731866"], ["updated_at", "2016-04-01 02:40:54.731866"]]
---
    def index
        latestNotification = Notification.last(1)[0];
        #notification.save
        require 'open-uri'
        output = ''
        link = ''

        doc = Nokogiri::HTML(open("https://martynchamberlin.com/feed"))

        begin_sending = false

        doc.xpath('//item').reverse_each do |item|
            link = item.xpath('guid')[0].content
            title = item.xpath('title')[0].content

            if ( begin_sending )
                # send SMS
                output += link
                Notification.new({guid: link}).save